{"id":"leslie1972","title":"The Survival of the Chinese Jews: The Jewish Community of Kaifeng","authors":"Donald Daniel Leslie","journal":"T'oung Pao Monographie X","year":"1972","doi":"N/A","url":"https://brill.com/view/title/4229","keyPoints":"Foundational work on Kaifeng Jewish history; analysis of Yuan Dynasty policies; documentation of stone inscriptions","keyHypotheses":"Chinese governmental tolerance enabled Jewish survival for over 1000 years","strengths":"Comprehensive primary source analysis; established academic framework","weaknesses":"Limited analysis of political participation mechanisms","citation":"Leslie, D.D. (1972). The Survival of the Chinese Jews: The Jewish Community of Kaifeng. Leiden: E.J. Brill.","notes":"Seminal work - all subsequent scholarship builds on this foundation","addedDate":"2025-10-04T01:56:00.000Z"}
{"id":"sharot2007","title":"The Kaifeng Jews: A Reconsideration of Acculturation and Assimilation in a Comparative Perspective","authors":"Stephen Sharot","journal":"Jewish Social Studies","year":"2007","doi":"10.2979/jss.2007.13.2.179","url":"https://muse.jhu.edu/article/219811","keyPoints":"Comparative analysis with Muslim minorities; role of Chinese religious pluralism; permeable boundaries of Chinese religion","keyHypotheses":"Chinese religious milieu was uniquely conducive to Jewish acculturation compared to other societies","strengths":"Sophisticated comparative methodology; theoretical framework","weaknesses":"Limited primary source material from Chinese archives","citation":"Sharot, S. (2007). The Kaifeng Jews: A Reconsideration of Acculturation and Assimilation in a Comparative Perspective. Jewish Social Studies, 13(2), 179-203.","notes":"Key theoretical work on mechanisms of Jewish integration","addedDate":"2025-10-04T01:56:00.000Z"}
{"id":"xu2019","title":"Chinese Policy Toward Kaifeng Jews","authors":"Xu Xin","journal":"The Image of Jews in Contemporary China","year":"2019","doi":"10.1515/9781618114211-006","url":"https://www.degruyterbrill.com/document/doi/10.1515/9781618114211-006/html","keyPoints":"1489 stele three-point covenant; distinction between pre-1840 and post-1840 Jews; PRC policies since 1950s","keyHypotheses":"Chinese policy of respecting religion while promoting integration enabled Jewish political participation","strengths":"Leading expert perspective; access to Chinese sources; contemporary policy analysis","weaknesses":"Limited by current Chinese academic restrictions","citation":"Xu, X. (2019). Chinese Policy Toward Kaifeng Jews. In The Image of Jews in Contemporary China (pp. 54-71). Academic Studies Press.","notes":"Most authoritative contemporary analysis by leading Chinese scholar","addedDate":"2025-10-04T01:56:00.000Z"}
{"id":"white1942","title":"Chinese Jews","authors":"William Charles White","journal":"University of Toronto Press","year":"1942","doi":"N/A","url":"N/A","keyPoints":"Three-part comprehensive documentation; letters and reports; Chinese and Hebrew documents; genealogical information","keyHypotheses":"Jewish community maintained distinct identity while integrating into Chinese society","strengths":"Extensive primary source collection; comprehensive documentation","weaknesses":"Pre-modern historical bias; limited theoretical framework","citation":"White, W.C. (1942). Chinese Jews. University of Toronto Press.","notes":"Classic reference work - reprinted 1966 by Paragon Book Reprint Corporation","addedDate":"2025-10-04T01:56:00.000Z"}
{"id":"katz2010","title":"The Jews of China and their Contribution to the Establishment of the Jewish National Home in Palestine in the First Half of the Twentieth Century","authors":"Yossi Katz","journal":"Middle Eastern Studies","year":"2010","doi":"N/A","url":"https://www.jstor.org/stable/20775055","keyPoints":"Political connections between Chinese Jews and Zionist movement; international networks; contribution to Jewish nationalism","keyHypotheses":"Chinese Jews maintained political connections beyond China contributing to global Jewish political movements","strengths":"Unique international perspective; documents transnational political networks","weaknesses":"Limited focus on domestic Chinese political participation","citation":"Katz, Y. (2010). The Jews of China and their Contribution to the Establishment of the Jewish National Home in Palestine in the First Half of the Twentieth Century. Middle Eastern Studies, 46(4), 543-554.","notes":"Demonstrates international political engagement of Chinese Jews","addedDate":"2025-10-04T01:56:00.000Z"}
{"id":"pollak2005","title":"The Jews of Kaifeng, China: History, Culture, and Religion (review)","authors":"Michael Pollak","journal":"Shofar","year":"2005","doi":"10.1353/sho.2005.0118","url":"https://muse.jhu.edu/article/182952","keyPoints":"Critical review of Xu Xin's work; assessment of existing scholarship; gaps in historical documentation","keyHypotheses":"Existing scholarship has addressed historical gaps but pseudo-history claims persist","strengths":"Critical scholarly assessment; identifies research needs","weaknesses":"Review format limits original analysis","citation":"Pollak, M. (2005). The Jews of Kaifeng, China: History, Culture, and Religion (review). Shofar, 23(3), 206-209.","notes":"Important scholarly critique highlighting research gaps","addedDate":"2025-10-04T01:56:00.000Z"}
{"id":"leslie1967","title":"The K'aifeng Jew Chao Ying-ch'eng and His Family","authors":"D. Leslie","journal":"T'oung Pao","year":"1967","doi":"N/A","url":"https://brill.com/view/journals/tpao/53/1/article-p147_2.xml","keyPoints":"Detailed family study of specific Kaifeng Jewish official; bureaucratic service documentation; social integration patterns","keyHypotheses":"Individual Jewish families achieved significant integration into Chinese bureaucratic system","strengths":"Detailed case study methodology; specific evidence of political participation","weaknesses":"Single family focus limits generalizability","citation":"Leslie, D. (1967). The K'aifeng Jew Chao Ying-ch'eng and His Family. T'oung Pao, 53(1), 147-183.","notes":"Provides concrete evidence of Jewish political participation in Chinese government","addedDate":"2025-10-04T01:56:00.000Z"}
{"id":"eber1993","title":"K'aifeng Jews Revisited: Sinification as Affirmation of Identity","authors":"Irene Eber","journal":"Monumenta Serica","year":"1993","doi":"10.1080/02549948.1993.11731245","url":"https://www.tandfonline.com/doi/full/10.1080/02549948.1993.11731245","keyPoints":"Sinification process as identity preservation; cultural adaptation strategies; religion and identity markers","keyHypotheses":"Sinification was a deliberate strategy for identity preservation rather than assimilation","strengths":"Novel theoretical perspective; challenges assimilation narratives","weaknesses":"Limited political analysis; focus primarily cultural","citation":"Eber, I. (1993). K'aifeng Jews Revisited: Sinification as Affirmation of Identity. Monumenta Serica, 41, 275-291.","notes":"Important reconceptualization of Chinese Jewish cultural strategies","addedDate":"2025-10-04T01:56:00.000Z"}
{"id":"wu2022","title":"Where Is the Home: Kaifeng Jews Descendants on the Road of Return","authors":"Jinyao Wu","journal":"Asian Journal of Social Science Studies","year":"2022","doi":"10.20849/ajsss.v7i9.1298","url":"http://journal.julypress.com/index.php/ajsss/article/download/1298/1002","keyPoints":"Contemporary identity negotiation; PRC ethnic classification impact; aliyah motivations; Israeli integration challenges","keyHypotheses":"Kaifeng Jewish identity persists despite official erasure and creates complex citizenship questions","strengths":"Contemporary fieldwork; interviews with community members; policy analysis","weaknesses":"Limited sample size; potential bias in self-selected interview subjects","citation":"Wu, J. (2022). Where Is the Home: Kaifeng Jews Descendants on the Road of Return. Asian Journal of Social Science Studies, 7(9), 63-78.","notes":"Most recent academic study with direct community access","addedDate":"2025-10-04T01:56:00.000Z"}
{"id":"graceffo2024","title":"After a thousand years, China's Kaifeng Jews have almost, but not quite, disappeared","authors":"Antonio Graceffo","journal":"MercatorNet","year":"2024","doi":"N/A","url":"https://www.mercatornet.com/after_a_thousand_years_china_s_kaifeng_jews_have_almost_but_not_quite_disappeared","keyPoints":"CCP fear of smallest religious community; synagogue destruction; scripture removal; non-recognition of religion and ethnicity","keyHypotheses":"CCP actively seeks to erase Jewish identity due to perceived political threat","strengths":"Current policy documentation; contemporary political analysis","weaknesses":"Journalistic rather than academic source; limited primary source access","citation":"Graceffo, A. (2024). After a thousand years, China's Kaifeng Jews have almost, but not quite, disappeared. MercatorNet.","notes":"Recent documentation of government suppression policies","addedDate":"2025-10-04T01:56:00.000Z"}
{"id":"wang2025","title":"China and Ashkenazic Jewry: transcultural encounters","authors":"Yaqiong Wang","journal":"Modern Chinese Studies","year":"2025","doi":"10.1080/14725886.2024.2431911","url":"https://www.tandfonline.com/doi/full/10.1080/14725886.2024.2431911","keyPoints":"Transcultural encounters; Ashkenazic Jewish perspectives; contemporary Chinese-Jewish relations","keyHypotheses":"Contemporary Chinese-Jewish relations reflect broader transcultural dynamics beyond Kaifeng community","strengths":"Latest scholarly perspective; international comparative approach","weaknesses":"Paywall access limits detailed analysis; recently published","citation":"Wang, Y. (2025). China and Ashkenazic Jewry: transcultural encounters. Modern Chinese Studies, doi: 10.1080/14725886.2024.2431911.","notes":"Most recent academic publication on Chinese-Jewish relations","addedDate":"2025-10-04T01:56:00.000Z"}
{"id":"haime2020","title":"Chinese Philo-Semitism: Why China Admires the Jewish People","authors":"Jordyn Haime","journal":"University of New Hampshire Student Research","year":"2020","doi":"N/A","url":"https://scholars.unh.edu/cgi/viewcontent.cgi?article=1027&context=student_research","keyPoints":"Contemporary Chinese attitudes toward Jews; philo-semitic discourse; education and success narratives; Holocaust awareness","keyHypotheses":"Modern Chinese philo-semitism reflects admiration for perceived Jewish success and education","strengths":"Contemporary social research; personal observation; cultural analysis","weaknesses":"Student research level; limited scope; non-peer reviewed","citation":"Haime, J. (2020). Chinese Philo-Semitism: Why China Admires the Jewish People. University of New Hampshire Student Research Projects, 26.","notes":"Provides contemporary Chinese perspective on Jewish identity","addedDate":"2025-10-04T01:56:00.000Z"}
{"id":"segev2018","title":"China's Ambivalent Attitude Towards Judaism","authors":"Hiddai Segev","journal":"Middle East Institute","year":"2018","doi":"N/A","url":"https://www.mei.edu/publications/chinas-ambivalent-attitude-towards-judaism","keyPoints":"Government ambivalence; historical tolerance vs. contemporary suppression; policy contradictions","keyHypotheses":"Chinese government maintains ambivalent approach balancing historical precedent with contemporary security concerns","strengths":"Policy analysis; institutional perspective; contemporary focus","weaknesses":"Think tank rather than academic source; limited primary source access","citation":"Segev, H. (2018). China's Ambivalent Attitude Towards Judaism. Middle East Institute.","notes":"Institutional analysis of contemporary Chinese Jewish policy","addedDate":"2025-10-04T01:56:00.000Z"}
{"id":"bernstein2019","title":"Sukkot and Mid-Autumn Festivals in Kaifeng: Conundrums at the Crossroads of Sino-Judaic Cultural Identity","authors":"Moshe Y. Bernstein","journal":"The Image of Jews in Contemporary China","year":"2019","doi":"10.1515/9781618114211-007","url":"https://www.degruyter.com/document/doi/10.1515/9781618114211-007/html","keyPoints":"Religious syncretism; festival overlap; cultural identity negotiation; Sino-Judaic practices","keyHypotheses":"Religious syncretism enabled Jewish survival while creating unique Sino-Judaic cultural forms","strengths":"Religious studies expertise; cultural analysis; syncretism focus","weaknesses":"Limited political analysis; primarily cultural focus","citation":"Bernstein, M.Y. (2019). Sukkot and Mid-Autumn Festivals in Kaifeng: Conundrums at the Crossroads of Sino-Judaic Cultural Identity. In The Image of Jews in Contemporary China (pp. 72-98). Academic Studies Press.","notes":"Detailed analysis of religious-cultural adaptation mechanisms","addedDate":"2025-10-04T01:56:00.000Z"}
{"id":"kestenbaum2016","title":"Who Are the Kaifeng Jews — and Why Is China 'Cracking Down' on Them?","authors":"Sam Kestenbaum","journal":"Forward","year":"2016","doi":"N/A","url":"https://forward.com/news/349913/who-are-the-kaifeng-jews-and-why-is-china-cracking-down-on-them/","keyPoints":"Government crackdown documentation; community suppression; international attention; policy shift under Xi Jinping","keyHypotheses":"Chinese government views Kaifeng Jews as potential political threat requiring suppression","strengths":"Contemporary documentation; international media attention; policy timing analysis","weaknesses":"Journalistic source; limited academic rigor; potential bias","citation":"Kestenbaum, S. (2016). Who Are the Kaifeng Jews — and Why Is China 'Cracking Down' on Them? Forward.","notes":"Documents shift from tolerance to suppression under current leadership","addedDate":"2025-10-04T01:56:00.000Z"}
{"id":"joplin2020","title":"CCP is Silencing Tiny Community of Kaifeng Jews","authors":"Ty Joplin","journal":"Bitter Winter","year":"2020","doi":"N/A","url":"https://bitterwinter.org/silencing-tiny-community-of-kaifeng-jews/","keyPoints":"Religious freedom violations; community silencing; surveillance; cultural suppression; international attention","keyHypotheses":"CCP systematic campaign to eliminate Jewish identity as part of broader religious suppression","strengths":"Human rights documentation; contemporary evidence; international perspective","weaknesses":"Advocacy publication bias; limited academic methodology","citation":"Joplin, T. (2020). CCP is Silencing Tiny Community of Kaifeng Jews. Bitter Winter.","notes":"Documents human rights violations and religious freedom restrictions","addedDate":"2025-10-04T01:56:00.000Z"}